DUTCO2QUEST50mm_casefile/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sideLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       299;
    }
    sideRight
    {
        type            patch;
        nFaces          1;
        startFace       300;
    }
    topbottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          600;
        startFace       301;
    }
    frontback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          600;
        startFace       901;
    }
)

// ************************************************************************* //
