DUTCO2QUEST50mm_casefile/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.8037
    
    volScalarFieldValue T.air 292.68
    volScalarFieldValue T.water 290.84
    volScalarFieldValue p 5439466.0
);

regions
(
    boxToCell
    {
        box (256 -1 -1) (257 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.8037 volScalarFieldValue T.air 290.84
volScalarFieldValue T.water 290.84 volScalarFieldValue p 5439466.0
        );
    }
);


// ************************************************************************* //
